Public Member Functions | Friends | List of all members
ACAPI::MEP::EquipmentDefault Class Referencefinal
MEP Element Manager
The EquipmentDefault contains the necessary non-geometric data for creating an Equipment element. More...
#include <MEPEquipmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::EquipmentDefault:
 Public Member Functions
Result< UniqueID >  | Place (const API_Coord3D &coordinate, const Orientation &orientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places an Equipment element based on this Default.
 Public Member Functions inherited from ACAPI::MEP::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< EquipmentDefault >  | CreateEquipmentDefault ()
Creates an EquipmentDefault.
MEPAPI_EXPORT Result< EquipmentDefault >  | CreateEquipmentDefault (const ACAPI::ElementDefault &defaultElem)
Creates an EquipmentDefault from the given base element default.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The EquipmentDefault contains the necessary non-geometric data for creating an Equipment element.
Since
Archicad 27
Example code snippet from Test / New MEP
Placement
 auto equipmentDefault = CreateEquipmentDefault ();
 if (equipmentDefault.IsErr ())
 return equipmentDefault.UnwrapErr ().kind;
 ACAPI::Result<UniqueID> equipmentId = equipmentDefault->Place ({ 20.0, 11.5, 0.0 }, { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GenerateAPIGuid ());
 if (equipmentId.IsErr ())
 return equipmentId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Equipment placed successfully", false);
Member Function Documentation
◆ Place()
 Result< UniqueID > ACAPI::MEP::EquipmentDefault::Place  |  ( |  const API_Coord3D & |  coordinate,
|  const Orientation & |  orientation,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt ) const
Places an Equipment element based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
coordinate | The coordinate where the Equipment will be placed.
orientation | The orientation of the Equipment, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the Equipment - optional parameter
Returns
If executed with success, returns the newly placed Equipment's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateEquipmentDefault [1/2]
 Result< EquipmentDefault > CreateEquipmentDefault  |  ( |   | )
friend
Creates an EquipmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the Equipment tool, otherwise Error.
◆ CreateEquipmentDefault [2/2]
 MEPAPI_EXPORT Result< EquipmentDefault > CreateEquipmentDefault  |  ( |  const ACAPI::ElementDefault & |  defaultElem | )
friend
Creates an EquipmentDefault from the given base element default.
Parameters
defaultElem | The base element default which will be converted to an EquipmentDefault.
Since
Archicad 29
Returns
If the given base element default refers to an Equipment, returns a copy of the EquipmentDefault, otherwise Error.